%1(start /max cmd.exe /c %0 :&exit)
@echo off
title 
path=%path%;E:\MAIN\U-MAIN\MAIN\JEF\out

echos 0x0a	C:\ProgramData\Microsoft\Windows\Start Menu\Programs\StartUp
dir /b "C:\ProgramData\Microsoft\Windows\Start Menu\Programs\StartUp"
echos 0x09	C:\Users\30580\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup
for /f %%i in ('dir /b "C:\Users\30580\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup"') do echo;    %%i
reg query "HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Run"
reg query "HKEY_LOCAL_MACHINE\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Run"
reg query "HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Run"

for /f "tokens=2 delims=:" %%i in ('ipconfig ^|find "IPv4" ') do set a=%%i
echos 0x0c %a%
echo;
echos 0x0a reg add "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\USBSTOR" /v Start /t reg_dword /d 1 /f
echo 注意：之前已经在这台计算机上连接过的USB存储设备仍旧可以被识别，
echo 但新的USB存储设备将不再可被使用。要取消上述限制，只需把4改成3即可。(改回1,win10)


echos 0x0c "%%1(start /min cmd.exe /c %%0 :& exit )"
echo;你的代码写在这下面,最小化运行至任务栏。

echos 0x07 mshta vbscript:msgbox("cctv",48,"65430")(window.close)
echos 0x0a "setlocal EnableDelayedExpansion"
echos 0x07 "set str=%%str:-=:%%"
echos 0x0a \"usebackq delims tokens\"
echos 0x07 %comspec:~9,1%hu%comspec:~14,1%d%comspec:~7,1%wn ^-%comspec:~9,1% -%comspec:~14,1% %comspec:~17,2%
echos 0x0a 关闭显示屏
echos 0x07 powershell (Add-Type '[DllImport(\"user32.dll\")]^public static extern int SendMessage(int hWnd, int hMsg, int wParam, int lParam);' -Name a -Pas)::SendMessage(-1,0x0112,0xF170,2)
echos 0x0a 注销
echos 0x07 rundll32 user32.dll,LockWorkStation
start cmd /c "%~d0\SQL server\tables.bat"
ping 127.1 -n 10 >nul
more +79 %0
ping 127.1 -n 5 >nul
echos 0x08 请按任意键结束. . .
ping 127.1 -n 5 >nul
shutdown -p
exit
rem %2start mshta vbscript:createobject("shell.application").shellexecute("""%~0""","%1 ::",,"runas",1)(window.close)&exi

                                                                                                                                                                                                                                                                        
8888888 8888888888   .8.          8 8888     ,88' 8 8888888888                 ,o888888o.           .8.          8 888888888o.   8 8888888888             `8.`8888.      ,8'  ,o888888o.     8 8888      88    d888888o.   8 8888888888   8 8888         8 8888888888   
      8 8888        .888.         8 8888    ,88'  8 8888                      8888     `88.        .888.         8 8888    `88.  8 8888                    `8.`8888.    ,8'. 8888     `88.   8 8888      88  .`8888:' `88. 8 8888         8 8888         8 8888         
      8 8888       :88888.        8 8888   ,88'   8 8888                   ,8 8888       `8.      :88888.        8 8888     `88  8 8888                     `8.`8888.  ,8',8 8888       `8b  8 8888      88  8.`8888.   Y8 8 8888         8 8888         8 8888         
      8 8888      . `88888.       8 8888  ,88'    8 8888                   88 8888               . `88888.       8 8888     ,88  8 8888                      `8.`8888.,8' 88 8888        `8b 8 8888      88  `8.`8888.     8 8888         8 8888         8 8888         
      8 8888     .8. `88888.      8 8888 ,88'     8 888888888888           88 8888              .8. `88888.      8 8888.   ,88'  8 888888888888               `8.`88888'  88 8888         88 8 8888      88   `8.`8888.    8 888888888888 8 8888         8 888888888888 
      8 8888    .8`8. `88888.     8 8888 88'      8 8888                   88 8888             .8`8. `88888.     8 888888888P'   8 8888                        `8. 8888   88 8888         88 8 8888      88    `8.`8888.   8 8888         8 8888         8 8888         
      8 8888   .8' `8. `88888.    8 888888<       8 8888                   88 8888            .8' `8. `88888.    8 8888`8b       8 8888                         `8 8888   88 8888        ,8P 8 8888      88     `8.`8888.  8 8888         8 8888         8 8888         
      8 8888  .8'   `8. `88888.   8 8888 `Y8.     8 8888                   `8 8888       .8' .8'   `8. `88888.   8 8888 `8b.     8 8888                          8 8888   `8 8888       ,8P  ` 8888     ,8P 8b   `8.`8888. 8 8888         8 8888         8 8888         
      8 8888 .888888888. `88888.  8 8888   `Y8.   8 8888                      8888     ,88' .888888888. `88888.  8 8888   `8b.   8 8888                          8 8888    ` 8888     ,88'     8888   ,d8P  `8b.  ;8.`8888 8 8888         8 8888         8 8888         
      8 8888.8'       `8. `88888. 8 8888     `Y8. 8 888888888888               `8888888P'  .8'       `8. `88888. 8 8888     `88. 8 888888888888                  8 8888       `8888888P'        `Y88888P'    `Y8888P ,88P' 8 888888888888 8 888888888888 8 8888         
	  
	  
                                                                                                                                                                                                                                                                                           
                                                                                                                                                                                                                                                                                               
         tttt                            kkkkkkkk                                                                                                                                                                                                                 lllllll    ffffffffffffffff  
      ttt:::t                            k::::::k                                                                                                                                                                                                                 l:::::l   f::::::::::::::::f 
      t:::::t                            k::::::k                                                                                                                                                                                                                 l:::::l  f::::::::::::::::::f
      t:::::t                            k::::::k                                                                                                                                                                                                                 l:::::l  f::::::fffffff:::::f
ttttttt:::::ttttttt      aaaaaaaaaaaaa    k:::::k    kkkkkkk eeeeeeeeeeee             cccccccccccccccc  aaaaaaaaaaaaa  rrrrr   rrrrrrrrr       eeeeeeeeeeee         yyyyyyy           yyyyyyy ooooooooooo   uuuuuu    uuuuuu      ssssssssss       eeeeeeeeeeee    l::::l  f:::::f       ffffff
t:::::::::::::::::t      a::::::::::::a   k:::::k   k:::::kee::::::::::::ee         cc:::::::::::::::c  a::::::::::::a r::::rrr:::::::::r    ee::::::::::::ee        y:::::y         y:::::yoo:::::::::::oo u::::u    u::::u    ss::::::::::s    ee::::::::::::ee  l::::l  f:::::f             
t:::::::::::::::::t      aaaaaaaaa:::::a  k:::::k  k:::::ke::::::eeeee:::::ee      c:::::::::::::::::c  aaaaaaaaa:::::ar:::::::::::::::::r  e::::::eeeee:::::ee       y:::::y       y:::::yo:::::::::::::::ou::::u    u::::u  ss:::::::::::::s  e::::::eeeee:::::eel::::l f:::::::ffffff       
tttttt:::::::tttttt               a::::a  k:::::k k:::::ke::::::e     e:::::e     c:::::::cccccc:::::c           a::::arr::::::rrrrr::::::re::::::e     e:::::e        y:::::y     y:::::y o:::::ooooo:::::ou::::u    u::::u  s::::::ssss:::::se::::::e     e:::::el::::l f::::::::::::f       
      t:::::t              aaaaaaa:::::a  k::::::k:::::k e:::::::eeeee::::::e     c::::::c     ccccccc    aaaaaaa:::::a r:::::r     r:::::re:::::::eeeee::::::e         y:::::y   y:::::y  o::::o     o::::ou::::u    u::::u   s:::::s  ssssss e:::::::eeeee::::::el::::l f::::::::::::f       
      t:::::t            aa::::::::::::a  k:::::::::::k  e:::::::::::::::::e      c:::::c               aa::::::::::::a r:::::r     rrrrrrre:::::::::::::::::e           y:::::y y:::::y   o::::o     o::::ou::::u    u::::u     s::::::s      e:::::::::::::::::e l::::l f:::::::ffffff       
      t:::::t           a::::aaaa::::::a  k:::::::::::k  e::::::eeeeeeeeeee       c:::::c              a::::aaaa::::::a r:::::r            e::::::eeeeeeeeeee             y:::::y:::::y    o::::o     o::::ou::::u    u::::u        s::::::s   e::::::eeeeeeeeeee  l::::l  f:::::f             
      t:::::t    tttttta::::a    a:::::a  k::::::k:::::k e:::::::e                c::::::c     ccccccca::::a    a:::::a r:::::r            e:::::::e                       y:::::::::y     o::::o     o::::ou:::::uuuu:::::u  ssssss   s:::::s e:::::::e           l::::l  f:::::f             
      t::::::tttt:::::ta::::a    a:::::a k::::::k k:::::ke::::::::e               c:::::::cccccc:::::ca::::a    a:::::a r:::::r            e::::::::e                       y:::::::y      o:::::ooooo:::::ou:::::::::::::::uus:::::ssss::::::se::::::::e         l::::::lf:::::::f            
      tt::::::::::::::ta:::::aaaa::::::a k::::::k  k:::::ke::::::::eeeeeeee        c:::::::::::::::::ca:::::aaaa::::::a r:::::r             e::::::::eeeeeeee                y:::::y       o:::::::::::::::o u:::::::::::::::us::::::::::::::s  e::::::::eeeeeeee l::::::lf:::::::f            
        tt:::::::::::tt a::::::::::aa:::ak::::::k   k:::::kee:::::::::::::e         cc:::::::::::::::c a::::::::::aa:::ar:::::r              ee:::::::::::::e               y:::::y         oo:::::::::::oo   uu::::::::uu:::u s:::::::::::ss    ee:::::::::::::e l::::::lf:::::::f            
          ttttttttttt    aaaaaaaaaa  aaaakkkkkkkk    kkkkkkk eeeeeeeeeeeeee           cccccccccccccccc  aaaaaaaaaa  aaaarrrrrrr                eeeeeeeeeeeeee              y:::::y            ooooooooooo       uuuuuuuu  uuuu  sssssssssss        eeeeeeeeeeeeee llllllllfffffffff            
                                                                                                                                                                          y:::::y                                                                                                              
                                                                                                                                                                         y:::::y                                                                                                               
                                                                                                                                                                        y:::::y                                                                                                                
                                                                                                                                                                       y:::::y                                                                                                                 
                                                                                                                                                                      yyyyyyy                                                                                                                  
                                                                                                                                                                                                                                                                                               
   __        __                                                               ______
__/ /_____ _/ /_____     _________ _________     __  ______  __  __________  / / __/
_  __/ __ `/ //_/ _ \   / ___/ __ `/ ___/ _ \   / / / / __ \/ / / / ___/ _ \/ / /_  
/ /_/ /_/ / ,< /  __/  / /__/ /_/ / /  /  __/  / /_/ / /_/ / /_/ (__  )  __/ / __/  
\__/\__,_/_/|_|\___/   \___/\__,_/_/   \___/   \__, /\____/\__,_/____/\___/_/_/     
                                              /____/                                

											  

'########::::'###::::'##:::'##:'########:::::'######:::::'###::::'########::'########::::'##:::'##::'#######::'##::::'##::'######::'########:'##:::::::'########:
... ##..::::'## ##::: ##::'##:: ##.....:::::'##... ##:::'## ##::: ##.... ##: ##.....:::::. ##:'##::'##.... ##: ##:::: ##:'##... ##: ##.....:: ##::::::: ##.....::
::: ##:::::'##:. ##:: ##:'##::: ##:::::::::: ##:::..:::'##:. ##:: ##:::: ##: ##:::::::::::. ####::: ##:::: ##: ##:::: ##: ##:::..:: ##::::::: ##::::::: ##:::::::
::: ##::::'##:::. ##: #####:::: ######:::::: ##:::::::'##:::. ##: ########:: ######::::::::. ##:::: ##:::: ##: ##:::: ##:. ######:: ######::: ##::::::: ######:::
::: ##:::: #########: ##. ##::: ##...::::::: ##::::::: #########: ##.. ##::: ##...:::::::::: ##:::: ##:::: ##: ##:::: ##::..... ##: ##...:::: ##::::::: ##...::::
::: ##:::: ##.... ##: ##:. ##:: ##:::::::::: ##::: ##: ##.... ##: ##::. ##:: ##::::::::::::: ##:::: ##:::: ##: ##:::: ##:'##::: ##: ##::::::: ##::::::: ##:::::::
::: ##:::: ##:::: ##: ##::. ##: ########::::. ######:: ##:::: ##: ##:::. ##: ########::::::: ##::::. #######::. #######::. ######:: ########: ########: ##:::::::
:::..:::::..:::::..::..::::..::........::::::......:::..:::::..::..:::::..::........::::::::..::::::.......::::.......::::......:::........::........::..::::::::


    ___                      ,-.                                                                                                                            ,--,            
  ,--.'|_                ,--/ /|                                                                                                                          ,--.'|     .--.,  
  |  | :,'             ,--. :/ |                                           __  ,-.                             ,---.           ,--,                       |  | :   ,--.'  \ 
  :  : ' :             :  : ' /                                          ,' ,'/ /|                            '   ,'\        ,'_ /|   .--.--.             :  : '   |  | /\/ 
.;__,'  /    ,--.--.   |  '  /      ,---.             ,---.     ,--.--.  '  | |' | ,---.                .--, /   /   |  .--. |  | :  /  /    '     ,---.  |  ' |   :  : :   
|  |   |    /       \  '  |  :     /     \           /     \   /       \ |  |   ,'/     \             /_ ./|.   ; ,. :,'_ /| :  . | |  :  /`./    /     \ '  | |   :  | |-, 
:__,'| :   .--.  .-. | |  |   \   /    /  |         /    / '  .--.  .-. |'  :  / /    /  |         , ' , ' :'   | |: :|  ' | |  . . |  :  ;_     /    /  ||  | :   |  : :/| 
  '  : |__  \__\/: . . '  : |. \ .    ' / |        .    ' /    \__\/: . .|  | ' .    ' / |        /___/ \: |'   | .; :|  | ' |  | |  \  \    `. .    ' / |'  : |__ |  |  .' 
  |  | '.'| ," .--.; | |  | ' \ \'   ;   /|        '   ; :__   ," .--.; |;  : | '   ;   /|         .  \  ' ||   :    |:  | : ;  ; |   `----.   \'   ;   /||  | '.'|'  : '   
  ;  :    ;/  /  ,.  | '  : |--' '   |  / |        '   | '.'| /  /  ,.  ||  , ; '   |  / |          \  ;   : \   \  / '  :  `--'   \ /  /`--'  /'   |  / |;  :    ;|  | |   
  |  ,   /;  :   .'   \;  |,'    |   :    |        |   :    :;  :   .'   \---'  |   :    |           \  \  ;  `----'  :  ,      .-./'--'.     / |   :    ||  ,   / |  : \   
   ---`-' |  ,     .-./'--'       \   \  /          \   \  / |  ,     .-./       \   \  /             :  \  \          `--`----'      `--'---'   \   \  /  ---`-'  |  |,'   
           `--`---'                `----'            `----'   `--`---'            `----'               \  ' ;                                     `----'           `--'     
                                                                                                        `--`                                                                
	